openesb/ApTuLiboOnline/test/TestCase1/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ven="http://j2ee.netbeans.org/wsdl/ServiciosVenta/DescriptorBPEL/VentaLibrosWSDL">
  <soapenv:Body>
    <ven:VentaLibrosWSDLOperation>
      <ISBN>?string?</ISBN>
      <idCliente>?string?</idCliente>
      <unidades>?3?</unidades>
      <precioUnidad>?3?</precioUnidad>
    </ven:VentaLibrosWSDLOperation>
  </soapenv:Body>
</soapenv:Envelope>